[Killed] BlockStatement
src/services/CheckoutService.js:2:65
 class CheckoutService {
-  constructor(gatewayPagamento, pedidoRepository, emailService) {
-    this.gatewayPagamento = gatewayPagamento;
-    this.pedidoRepository = pedidoRepository;
-    this.emailService = emailService;
-    this.TIMEOUT_MS = 2000; 
-    this.MAX_RETRIES = 3;  
-    this.BACKOFF_MS = 500;  
-  }
+  constructor(gatewayPagamento, pedidoRepository, emailService) {}
 
   async processar(pedido) {
killedBy: CheckoutService - Suite de Testes Unitários Deve processar com sucesso, salvar e disparar e-mail assíncrono se aprovado
statusReason: TypeError: Cannot read properties of undefined (reading 'salvar')

[Killed] BlockStatement
src/services/CheckoutService.js:11:27
     this.BACKOFF_MS = 500;  
   }
 
-  async processar(pedido) {
-    this._validarPayload(pedido);
-
-    try {
-      const resposta = await this._executarCobrancaComRetry(pedido);
-
-      if (resposta.status === 'APROVADO') {
-        return await this._tratarSucesso(pedido);
-      } else {
-        return await this._tratarRecusa(pedido);
-      }
-    } catch (error) {
-      return await this._tratarFallbackErro(pedido, error);
-    }
-  }
+  async processar(pedido) {}
 
   _validarPayload(pedido) {
killedBy: CheckoutService - Suite de Testes Unitários Deve abortar com erro 400 se o payload falhar em regras específicas
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BlockStatement
src/services/CheckoutService.js:14:9
   async processar(pedido) {
     this._validarPayload(pedido);
 
-    try {
-      const resposta = await this._executarCobrancaComRetry(pedido);
-
-      if (resposta.status === 'APROVADO') {
-        return await this._tratarSucesso(pedido);
-      } else {
-        return await this._tratarRecusa(pedido);
-      }
-    } catch (error) {
+    try {} catch (error) {
       return await this._tratarFallbackErro(pedido, error);
     }
killedBy: CheckoutService - Suite de Testes Unitários Deve processar com sucesso, salvar e disparar e-mail assíncrono se aprovado
statusReason: TypeError: Cannot read properties of undefined (reading 'status')

[Killed] BlockStatement
src/services/CheckoutService.js:17:43
     try {
       const resposta = await this._executarCobrancaComRetry(pedido);
 
-      if (resposta.status === 'APROVADO') {
-        return await this._tratarSucesso(pedido);
-      } else {
+      if (resposta.status === 'APROVADO') {} else {
         return await this._tratarRecusa(pedido);
       }
killedBy: CheckoutService - Suite de Testes Unitários Deve processar com sucesso, salvar e disparar e-mail assíncrono se aprovado
statusReason: TypeError: Cannot read properties of undefined (reading 'status')

[Killed] EqualityOperator
src/services/CheckoutService.js:17:11
     try {
       const resposta = await this._executarCobrancaComRetry(pedido);
 
-      if (resposta.status === 'APROVADO') {
+      if (resposta.status !== 'APROVADO') {
         return await this._tratarSucesso(pedido);
       } else {
killedBy: CheckoutService - Suite de Testes Unitários Deve processar com sucesso, salvar e disparar e-mail assíncrono se aprovado
statusReason: TypeError: Cannot read properties of null (reading 'status')

[Killed] BlockStatement
src/services/CheckoutService.js:19:14
 
       if (resposta.status === 'APROVADO') {
         return await this._tratarSucesso(pedido);
-      } else {
-        return await this._tratarRecusa(pedido);
-      }
+      } else {}
     } catch (error) {
       return await this._tratarFallbackErro(pedido, error);
killedBy: CheckoutService - Suite de Testes Unitários Deve marcar como FALHOU e bloquear e-mail se o cartão for recusado
statusReason: Error: expect(received).toBeNull()

Received: undefined

[Killed] BlockStatement
src/services/CheckoutService.js:22:21
       } else {
         return await this._tratarRecusa(pedido);
       }
-    } catch (error) {
-      return await this._tratarFallbackErro(pedido, error);
-    }
+    } catch (error) {}
   }
 
killedBy: CheckoutService - Suite de Testes Unitários Deve falhar de forma limpa com erro 500 e salvar ERRO_GATEWAY se estourar os retries
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BlockStatement
src/services/CheckoutService.js:27:27
     }
   }
 
-  _validarPayload(pedido) {
-    const emailRegex = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
-    if (!pedido || !pedido.clienteEmail || !emailRegex.test(pedido.clienteEmail) || 
-        !pedido.valor || pedido.valor <= 0 || !pedido.cartao) {
-      const error = new Error("Bad Request: Payload incompleto ou inválido.");
-      error.status = 400;
-      throw error;
-    }
-  }
+  _validarPayload(pedido) {}
 
   async _executarCobrancaComRetry(pedido) {
killedBy: CheckoutService - Suite de Testes Unitários Deve abortar com erro 400 se o payload falhar em regras específicas
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Bad Request"
Received message:   "Erro interno de processamento. Tente mais tarde."

      180 |       pedido.status = stryMutAct_9fa48("69") ? "" : (stryCov_9fa48("69"), 'ERRO_GATEWAY');
      181 |       await this.pedidoRepository.salvar(pedido);
    > 182 |       const erroAmigavel = new Error(stryMutAct_9fa48("70") ? "" :

[Killed] Regex
src/services/CheckoutService.js:28:24
   }
 
   _validarPayload(pedido) {
-    const emailRegex = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
+    const emailRegex = /[^\s@]+@[^\s@]+\.[^\s@]+$/;
     if (!pedido || !pedido.clienteEmail || !emailRegex.test(pedido.clienteEmail) || 
         !pedido.valor || pedido.valor <= 0 || !pedido.cartao) {
killedBy: CheckoutService - Suite de Testes Unitários Deve abortar com erro 400 se o payload falhar em regras específicas
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Bad Request"
Received message:   "Erro interno de processamento. Tente mais tarde."

      180 |       pedido.status = stryMutAct_9fa48("69") ? "" : (stryCov_9fa48("69"), 'ERRO_GATEWAY');
      181 |       await this.pedidoRepository.salvar(pedido);
    > 182 |       const erroAmigavel = new Error(stryMutAct_9fa48("70") ? "" :

[Killed] Regex
src/services/CheckoutService.js:28:24
   }
 
   _validarPayload(pedido) {
-    const emailRegex = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
+    const emailRegex = /^[\s@]+@[^\s@]+\.[^\s@]+$/;
     if (!pedido || !pedido.clienteEmail || !emailRegex.test(pedido.clienteEmail) || 
         !pedido.valor || pedido.valor <= 0 || !pedido.cartao) {
killedBy: CheckoutService - Suite de Testes Unitários Deve processar com sucesso, salvar e disparar e-mail assíncrono se aprovado
statusReason: Error: Bad Request: Payload incompleto ou inválido.

[Killed] BooleanLiteral
src/services/CheckoutService.js:29:44
 
   _validarPayload(pedido) {
     const emailRegex = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
-    if (!pedido || !pedido.clienteEmail || !emailRegex.test(pedido.clienteEmail) || 
+    if (!pedido || !pedido.clienteEmail || emailRegex.test(pedido.clienteEmail) || 
         !pedido.valor || pedido.valor <= 0 || !pedido.cartao) {
       const error = new Error("Bad Request: Payload incompleto ou inválido.");
killedBy: CheckoutService - Suite de Testes Unitários Deve abortar com erro 400 se o payload falhar em regras específicas
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Bad Request"
Received message:   "Erro interno de processamento. Tente mais tarde."

      180 |       pedido.status = stryMutAct_9fa48("69") ? "" : (stryCov_9fa48("69"), 'ERRO_GATEWAY');
      181 |       await this.pedidoRepository.salvar(pedido);
    > 182 |       const erroAmigavel = new Error(stryMutAct_9fa48("70") ? "" :

[Killed] ConditionalExpression
src/services/CheckoutService.js:29:9
 
   _validarPayload(pedido) {
     const emailRegex = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
-    if (!pedido || !pedido.clienteEmail || !emailRegex.test(pedido.clienteEmail) || 
-        !pedido.valor || pedido.valor <= 0 || !pedido.cartao) {
+    if (false || !pedido.cartao) {
       const error = new Error("Bad Request: Payload incompleto ou inválido.");
       error.status = 400;
killedBy: CheckoutService - Suite de Testes Unitários Deve abortar com erro 400 se o payload falhar em regras específicas
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Bad Request"
Received message:   "Erro interno de processamento. Tente mais tarde."

      180 |       pedido.status = stryMutAct_9fa48("69") ? "" : (stryCov_9fa48("69"), 'ERRO_GATEWAY');
      181 |       await this.pedidoRepository.salvar(pedido);
    > 182 |       const erroAmigavel = new Error(stryMutAct_9fa48("70") ? "" :

[Killed] BooleanLiteral
src/services/CheckoutService.js:30:9
   _validarPayload(pedido) {
     const emailRegex = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
     if (!pedido || !pedido.clienteEmail || !emailRegex.test(pedido.clienteEmail) || 
-        !pedido.valor || pedido.valor <= 0 || !pedido.cartao) {
+        pedido.valor || pedido.valor <= 0 || !pedido.cartao) {
       const error = new Error("Bad Request: Payload incompleto ou inválido.");
       error.status = 400;
killedBy: CheckoutService - Suite de Testes Unitários Deve processar com sucesso, salvar e disparar e-mail assíncrono se aprovado
statusReason: Error: Bad Request: Payload incompleto ou inválido.

[Killed] BlockStatement
src/services/CheckoutService.js:30:63
   _validarPayload(pedido) {
     const emailRegex = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
     if (!pedido || !pedido.clienteEmail || !emailRegex.test(pedido.clienteEmail) || 
-        !pedido.valor || pedido.valor <= 0 || !pedido.cartao) {
-      const error = new Error("Bad Request: Payload incompleto ou inválido.");
-      error.status = 400;
-      throw error;
-    }
+        !pedido.valor || pedido.valor <= 0 || !pedido.cartao) {}
   }
 
killedBy: CheckoutService - Suite de Testes Unitários Deve abortar com erro 400 se o payload falhar em regras específicas
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Bad Request"
Received message:   "Erro interno de processamento. Tente mais tarde."

      180 |       pedido.status = stryMutAct_9fa48("69") ? "" : (stryCov_9fa48("69"), 'ERRO_GATEWAY');
      181 |       await this.pedidoRepository.salvar(pedido);
    > 182 |       const erroAmigavel = new Error(stryMutAct_9fa48("70") ? "" :

[Killed] StringLiteral
src/services/CheckoutService.js:31:31
     const emailRegex = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
     if (!pedido || !pedido.clienteEmail || !emailRegex.test(pedido.clienteEmail) || 
         !pedido.valor || pedido.valor <= 0 || !pedido.cartao) {
-      const error = new Error("Bad Request: Payload incompleto ou inválido.");
+      const error = new Error("");
       error.status = 400;
       throw error;
killedBy: CheckoutService - Suite de Testes Unitários Deve abortar com erro 400 se o payload falhar em regras específicas
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Bad Request"
Received message:   ""

      109 |         } else {
      110 |           stryCov_9fa48("41");
    > 111 |           const error = new Error(stryMutAct_9fa48("42") ? "" : (stryCov_9fa48("42"), "Bad Request: Payload incompleto ou inválido."));

[Killed] BlockStatement
src/services/CheckoutService.js:37:43
     }
   }
 
-  async _executarCobrancaComRetry(pedido) {
-    let tentativas = 0;
-
-    while (tentativas <= this.MAX_RETRIES) {
-      try {
-        return await Promise.race([
-          this.gatewayPagamento.cobrar(pedido.valor, pedido.cartao),
-          new Promise((_, reject) => 
-            setTimeout(() => reject(new Error("Timeout Operacional")), this.TIMEOUT_MS)
-          )
-        ]);
-      } catch (error) {
-        tentativas++;
-        if (tentativas > this.MAX_RETRIES) throw error;
-        await new Promise(resolve => setTimeout(resolve, this.BACKOFF_MS));
-      }
-    }
-  }
+  async _executarCobrancaComRetry(pedido) {}
 
   async _tratarSucesso(pedido) {
killedBy: CheckoutService - Suite de Testes Unitários Deve processar com sucesso, salvar e disparar e-mail assíncrono se aprovado
statusReason: Error: Erro interno de processamento. Tente mais tarde.

[Killed] ConditionalExpression
src/services/CheckoutService.js:40:12
   async _executarCobrancaComRetry(pedido) {
     let tentativas = 0;
 
-    while (tentativas <= this.MAX_RETRIES) {
+    while (false) {
       try {
         return await Promise.race([
killedBy: CheckoutService - Suite de Testes Unitários Deve processar com sucesso, salvar e disparar e-mail assíncrono se aprovado
statusReason: Error: Erro interno de processamento. Tente mais tarde.

[Killed] EqualityOperator
src/services/CheckoutService.js:40:12
   async _executarCobrancaComRetry(pedido) {
     let tentativas = 0;
 
-    while (tentativas <= this.MAX_RETRIES) {
+    while (tentativas > this.MAX_RETRIES) {
       try {
         return await Promise.race([
killedBy: CheckoutService - Suite de Testes Unitários Deve processar com sucesso, salvar e disparar e-mail assíncrono se aprovado
statusReason: Error: Erro interno de processamento. Tente mais tarde.

[Timeout] BlockStatement
src/services/CheckoutService.js:41:11
     let tentativas = 0;
 
     while (tentativas <= this.MAX_RETRIES) {
-      try {
-        return await Promise.race([
-          this.gatewayPagamento.cobrar(pedido.valor, pedido.cartao),
-          new Promise((_, reject) => 
-            setTimeout(() => reject(new Error("Timeout Operacional")), this.TIMEOUT_MS)
-          )
-        ]);
-      } catch (error) {
+      try {} catch (error) {
         tentativas++;
         if (tentativas > this.MAX_RETRIES) throw error;

[Survived] ArrowFunction
src/services/CheckoutService.js:44:23
       try {
         return await Promise.race([
           this.gatewayPagamento.cobrar(pedido.valor, pedido.cartao),
-          new Promise((_, reject) => 
-            setTimeout(() => reject(new Error("Timeout Operacional")), this.TIMEOUT_MS)
+          new Promise(() => undefined
           )
         ]);

[Survived] ArrowFunction
src/services/CheckoutService.js:45:24
         return await Promise.race([
           this.gatewayPagamento.cobrar(pedido.valor, pedido.cartao),
           new Promise((_, reject) => 
-            setTimeout(() => reject(new Error("Timeout Operacional")), this.TIMEOUT_MS)
+            setTimeout(() => undefined, this.TIMEOUT_MS)
           )
         ]);

[Timeout] BlockStatement
src/services/CheckoutService.js:48:23
             setTimeout(() => reject(new Error("Timeout Operacional")), this.TIMEOUT_MS)
           )
         ]);
-      } catch (error) {
-        tentativas++;
-        if (tentativas > this.MAX_RETRIES) throw error;
-        await new Promise(resolve => setTimeout(resolve, this.BACKOFF_MS));
-      }
+      } catch (error) {}
     }
   }

[Killed] UpdateOperator
src/services/CheckoutService.js:49:9
           )
         ]);
       } catch (error) {
-        tentativas++;
+        tentativas--;
         if (tentativas > this.MAX_RETRIES) throw error;
         await new Promise(resolve => setTimeout(resolve, this.BACKOFF_MS));
killedBy: CheckoutService - Suite de Testes Unitários Deve falhar de forma limpa com erro 500 e salvar ERRO_GATEWAY se estourar os retries
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] EqualityOperator
src/services/CheckoutService.js:50:13
         ]);
       } catch (error) {
         tentativas++;
-        if (tentativas > this.MAX_RETRIES) throw error;
+        if (tentativas >= this.MAX_RETRIES) throw error;
         await new Promise(resolve => setTimeout(resolve, this.BACKOFF_MS));
       }
killedBy: CheckoutService - Suite de Testes Unitários Deve falhar de forma limpa com erro 500 e salvar ERRO_GATEWAY se estourar os retries
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 4
Received number of calls: 3

[Killed] ConditionalExpression
src/services/CheckoutService.js:50:13
         ]);
       } catch (error) {
         tentativas++;
-        if (tentativas > this.MAX_RETRIES) throw error;
+        if (false) throw error;
         await new Promise(resolve => setTimeout(resolve, this.BACKOFF_MS));
       }
killedBy: CheckoutService - Suite de Testes Unitários Deve falhar de forma limpa com erro 500 e salvar ERRO_GATEWAY se estourar os retries
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Acionando Fallback. Erro:", "Gateway offline (500)"
Received: "Acionando Fallback. Erro:", "Cannot read properties of undefined (reading 'status')"

Number of calls: 1

[Timeout] ArrowFunction
src/services/CheckoutService.js:51:27
       } catch (error) {
         tentativas++;
         if (tentativas > this.MAX_RETRIES) throw error;
-        await new Promise(resolve => setTimeout(resolve, this.BACKOFF_MS));
+        await new Promise(() => undefined);
       }
     }

[Killed] BlockStatement
src/services/CheckoutService.js:56:32
     }
   }
 
-  async _tratarSucesso(pedido) {
-    pedido.status = 'PROCESSADO';
-    const pedidoSalvo = await this.pedidoRepository.salvar(pedido);
-
-    // E-mail Assíncrono (Non-blocking)
-    this.emailService.enviarConfirmacao(pedido.clienteEmail, "Pagamento Aprovado")
-      .catch(err => console.error("Falha em segundo plano ao enviar e-mail:", err.message));
-
-    return pedidoSalvo;
-  }
+  async _tratarSucesso(pedido) {}
 
   async _tratarRecusa(pedido) {
killedBy: CheckoutService - Suite de Testes Unitários Deve processar com sucesso, salvar e disparar e-mail assíncrono se aprovado
statusReason: TypeError: Cannot read properties of undefined (reading 'status')

[Killed] StringLiteral
src/services/CheckoutService.js:61:62
     const pedidoSalvo = await this.pedidoRepository.salvar(pedido);
 
     // E-mail Assíncrono (Non-blocking)
-    this.emailService.enviarConfirmacao(pedido.clienteEmail, "Pagamento Aprovado")
+    this.emailService.enviarConfirmacao(pedido.clienteEmail, "")
       .catch(err => console.error("Falha em segundo plano ao enviar e-mail:", err.message));
 
killedBy: CheckoutService - Suite de Testes Unitários Deve processar com sucesso, salvar e disparar e-mail assíncrono se aprovado
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "cliente@entregasja.com", "Pagamento Aprovado"
Received: "cliente@entregasja.com", ""

Number of calls: 1

[Killed] ArrowFunction
src/services/CheckoutService.js:62:14
 
     // E-mail Assíncrono (Non-blocking)
     this.emailService.enviarConfirmacao(pedido.clienteEmail, "Pagamento Aprovado")
-      .catch(err => console.error("Falha em segundo plano ao enviar e-mail:", err.message));
+      .catch(() => undefined);
 
     return pedidoSalvo;
killedBy: CheckoutService - Suite de Testes Unitários Deve registrar log de erro se o e-mail falhar assincronamente
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Falha em segundo plano ao enviar e-mail:", "SMTP Offline"

Number of calls: 0

[Killed] BlockStatement
src/services/CheckoutService.js:67:31
     return pedidoSalvo;
   }
 
-  async _tratarRecusa(pedido) {
-    pedido.status = 'FALHOU'; 
-    await this.pedidoRepository.salvar(pedido);
-    return null; 
-  }
+  async _tratarRecusa(pedido) {}
 
   async _tratarFallbackErro(pedido, error) {
killedBy: CheckoutService - Suite de Testes Unitários Deve marcar como FALHOU e bloquear e-mail se o cartão for recusado
statusReason: Error: expect(received).toBeNull()

Received: undefined

[Killed] StringLiteral
src/services/CheckoutService.js:68:21
   }
 
   async _tratarRecusa(pedido) {
-    pedido.status = 'FALHOU'; 
+    pedido.status = ""; 
     await this.pedidoRepository.salvar(pedido);
     return null; 
killedBy: CheckoutService - Suite de Testes Unitários Deve marcar como FALHOU e bloquear e-mail se o cartão for recusado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "FALHOU"
Received: ""

[Killed] BlockStatement
src/services/CheckoutService.js:73:44
     return null; 
   }
 
-  async _tratarFallbackErro(pedido, error) {
-    // LINHA CORRIGIDA AQUI PARA PASSAR NO TESTE E MATAR O MUTANTE
-    console.error("Acionando Fallback. Erro:", error.message);
-    
-    pedido.status = 'ERRO_GATEWAY'; 
-    await this.pedidoRepository.salvar(pedido);
-    
-    const erroAmigavel = new Error("Erro interno de processamento. Tente mais tarde.");
-    erroAmigavel.status = 500;
-    throw erroAmigavel;
-  }
+  async _tratarFallbackErro(pedido, error) {}
 }
 
killedBy: CheckoutService - Suite de Testes Unitários Deve falhar de forma limpa com erro 500 e salvar ERRO_GATEWAY se estourar os retries
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] StringLiteral
src/services/CheckoutService.js:80:36
     pedido.status = 'ERRO_GATEWAY'; 
     await this.pedidoRepository.salvar(pedido);
     
-    const erroAmigavel = new Error("Erro interno de processamento. Tente mais tarde.");
+    const erroAmigavel = new Error("");
     erroAmigavel.status = 500;
     throw erroAmigavel;
killedBy: CheckoutService - Suite de Testes Unitários Deve falhar de forma limpa com erro 500 e salvar ERRO_GATEWAY se estourar os retries
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Erro interno de processamento"
Received message:   ""

      180 |       pedido.status = stryMutAct_9fa48("69") ? "" : (stryCov_9fa48("69"), 'ERRO_GATEWAY');
      181 |       await this.pedidoRepository.salvar(pedido);
    > 182 |       const erroAmigavel = new Error(stryMutAct_9fa48("70") ? "" : (stryCov_9fa48("70"), "Erro i
